tiborsimon/embedded-tdd-headers/pic/pic18/pic18f86j55_tdd.h
#define TRISF_RF7                     1091
#define TRISG                         1092
#define TRISG0                        1093
#define TRISG_RG0                     1094
#define TRISG1                        1095
#define TRISG_RG1                     1096
#define TRISG2                        1097
#define TRISG_RG2                     1098
#define TRISG_RG3                     1099
#define TRISG3                        1100
#define TRISG4                        1101
#define TRISG_RG4                     1102
#define TRISH                         1103
#define TRISH_RH0                     1104
#define TRISH0                        1105
#define TRISH_RH1                     1106
#define TRISH1                        1107
#define TRISH_RH2                     1108
#define TRISH2                        1109
#define TRISH_RH3                     1110
#define TRISH3                        1111
#define TRISH_RH4                     1112
#define TRISH4                        1113
#define TRISH_RH5                     1114
#define TRISH5                        1115
#define TRISH_RH6                     1116
#define TRISH6                        1117
#define TRISH_RH7                     1118
#define TRISH7                        1119
#define TRISJ                         1120
#define TRISJ_RJ0                     1121
#define TRISJ0                        1122
#define TRISJ_RJ1                     1123
#define TRISJ1                        1124
#define TRISJ_RJ2                     1125
#define TRISJ2                        1126
#define TRISJ_RJ3                     1127
#define TRISJ3                        1128
#define TRISJ_RJ4                     1129
#define TRISJ4                        1130
#define TRISJ_RJ5                     1131
#define TRISJ5                        1132
#define TRISJ_RJ6                     1133
#define TRISJ6                        1134
#define TRISJ_RJ7                     1135
#define TRISJ7                        1136
#define OSCTUNE                       1137
#define TUN0                          1138
#define TUN1                          1139
#define TUN2                          1140
#define TUN3                          1141
#define TUN4                          1142
#define TUN5                          1143
#define PLLEN                         1144
#define INTSRC                        1145
#define RCSTA2                        1146
#define RCD82                         1147
#define RX9D2                         1148
#define RCSTA2_RCD8                   1149
#define RCSTA2_RX9D                   1150
#define RCSTA2_OERR                   1151
#define OERR2                         1152
#define FERR2                         1153
#define RCSTA2_FERR                   1154
#define ADDEN2                        1155
#define RCSTA2_ADDEN                  1156
#define RCSTA2_CREN                   1157
#define CREN2                         1158
#define SREN2                         1159
#define RCSTA2_SREN                   1160
#define RC92                          1161
#define RCSTA2_nRC8                   1162
#define RC8_92                        1163
#define RCSTA2_RX9                    1164
#define RCSTA2_NOT_RC8                1165
#define RCSTA2_RC9                    1166
#define RCSTA2_RC8_9                  1167
#define RX92                          1168
#define RCSTA2_SPEN                   1169
#define SPEN2                         1170
#define PIE1                          1171
#define TMR1IE                        1172
#define TMR2IE                        1173
#define CCP1IE                        1174
#define SSP1IE                        1175
#define SSPIE                         1176
#define TXIE                          1177
#define TX1IE                         1178
#define RC1IE                         1179
#define RCIE                          1180
#define ADIE                          1181
#define PSPIE                         1182
#define PMPIE                         1183
#define PIR1                          1184
#define TMR1IF                        1185
#define TMR2IF                        1186
#define CCP1IF                        1187
#define SSPIF                         1188
#define SSP1IF                        1189
#define TXIF                          1190
#define TX1IF                         1191
#define RCIF                          1192
#define RC1IF                         1193
#define ADIF                          1194
#define PSPIF                         1195
#define PMPIF                         1196
#define IPR1                          1197
#define TMR1IP                        1198
#define TMR2IP                        1199
#define CCP1IP                        1200
#define SSPIP                         1201
#define SSP1IP                        1202
#define TX1IP                         1203
#define TXIP                          1204
#define RCIP                          1205
#define RC1IP                         1206
#define ADIP                          1207
#define PMPIP                         1208
#define PSPIP                         1209
#define PIE2                          1210
#define CCP2IE                        1211
#define TMR3IE                        1212
#define LVDIE                         1213
#define BCL1IE                        1214
#define BCLIE                         1215
#define USBIE                         1216
#define CM1IE                         1217
#define CMIE                          1218
#define CM2IE                         1219
#define OSCFIE                        1220
#define PIR2                          1221
#define CCP2IF                        1222
#define TMR3IF                        1223
#define LVDIF                         1224
#define BCL1IF                        1225
#define BCLIF                         1226
#define USBIF                         1227
#define CM1IF                         1228
#define CMIF                          1229
#define CM2IF                         1230
#define OSCFIF                        1231
#define IPR2                          1232
#define CCP2IP                        1233
#define TMR3IP                        1234
#define LVDIP                         1235
#define BCLIP                         1236
#define BCL1IP                        1237
#define USBIP                         1238
#define CM1IP                         1239
#define CM2IP                         1240
#define CMIP                          1241
#define OSCFIP                        1242
#define PIE3                          1243
#define CCP3IE                        1244
#define RXB0IE                        1245
#define RXBNIE                        1246
#define RXB1IE                        1247
#define CCP4IE                        1248
#define TXB0IE                        1249
#define CCP5IE                        1250
#define TXB1IE                        1251
#define TMR4IE                        1252
#define TXB2IE                        1253
#define TXBNIE                        1254
#define TX2IE                         1255
#define RC2IE                         1256
#define BCL2IE                        1257
#define SSP2IE                        1258
#define PIR3                          1259
#define CCP3IF                        1260
#define RXBNIF                        1261
#define CCP4IF                        1262
#define CCP5IF                        1263
#define TMR4IF                        1264
#define TXBNIF                        1265
#define TX2IF                         1266
#define RC2IF                         1267
#define BCL2IF                        1268
#define SSP2IF                        1269
#define IPR3                          1270
#define CCP3IP                        1271
#define CCP4IP                        1272
#define RXBNIP                        1273
#define CCP5IP                        1274
#define TMR4IP                        1275
#define TX2IP                         1276
#define TXBNIP                        1277
#define RC2IP                         1278
#define BCL2IP                        1279
#define SSP2IP                        1280
#define EECON1                        1281
#define WR                            1282
#define WREN                          1283
#define WRERR                         1284
#define FREE                          1285
#define WPROG                         1286
#define TXSTA2                        1287
#define TXSTA2_TXD8                   1288
#define TX9D2                         1289
#define TXSTA2_TX9D                   1290
#define TXD82                         1291
#define TRMT2                         1292
#define TXSTA2_TRMT                   1293
#define BRGH2                         1294
#define TXSTA2_BRGH                   1295
#define SENDB2                        1296
#define TXSTA2_SENDB                  1297
#define TXSTA2_SYNC                   1298
#define SYNC2                         1299
#define TXEN2                         1300
#define TXSTA2_TXEN                   1301
#define TX8_92                        1302
#define TX92                          1303
#define TXSTA2_TX9                    1304
#define TXSTA2_nTX8                   1305
#define TXSTA2_NOT_TX8                1306
#define TXSTA2_TX8_9                  1307
#define TXSTA2_CSRC                   1308
#define CSRC2                         1309
#define RCSTA1                        1310
#define RCSTA1_RX9D                   1311
#define RX9D1                         1312
#define RCSTA1_RCD8                   1313
#define RCSTA1_OERR                   1314
#define OERR1                         1315
#define RCSTA1_FERR                   1316
#define FERR1                         1317
#define RCSTA1_ADDEN                  1318
#define ADDEN1                        1319
#define RCSTA1_CREN                   1320
#define CREN1                         1321
#define SRENA                         1322
#define SREN1                         1323
#define RCSTA1_SREN                   1324
#define RCSTA1_NOT_RC8                1325
#define RCSTA1_RC9                    1326
#define RCSTA1_nRC8                   1327
#define RCSTA1_RC8_9                  1328
#define RCSTA1_RX9                    1329
#define RX91                          1330
#define RCSTA1_SPEN                   1331
#define SPEN1                         1332
#define TXSTA1                        1333
#define TX9D1                         1334
#define TXSTA1_TX9D                   1335
#define TXSTA1_TXD8                   1336
#define TRMT1                         1337
#define TXSTA1_TRMT                   1338
#define BRGH1                         1339
#define TXSTA1_BRGH                   1340
#define TXSTA1_SENDB                  1341
#define SENDB1                        1342
#define TXSTA1_SYNC                   1343
#define SYNC1                         1344
#define TXEN1                         1345
#define TXSTA1_TXEN                   1346
#define TX91                          1347
#define TXSTA1_NOT_TX8                1348
#define TXSTA1_TX8_9                  1349
#define TXSTA1_TX9                    1350
#define TXSTA1_nTX8                   1351
#define TXSTA1_CSRC                   1352
#define CSRC1                         1353
#define ECCP3CON                      1354
#define CCP3M                         1355
#define CCP3M0                        1356
#define CCP3M1                        1357
#define CCP3M2                        1358
#define CCP3M3                        1359
#define CCP3Y                         1360
#define DC3B                          1361
#define DC3B0                         1362
#define DC3B1                         1363
#define CCP3X                         1364
#define P3M                           1365
#define P3M0                          1366
#define P3M1                          1367
#define ECCP3DEL                      1368
#define ECCP3DEL_PDC0                 1369
#define P3DC0                         1370
#define ECCP3DEL_PDC                  1371
#define ECCP3DEL_PDC1                 1372
#define P3DC1                         1373
#define ECCP3DEL_PDC2                 1374
#define P3DC2                         1375
#define ECCP3DEL_PDC3                 1376
#define P3DC3                         1377
#define ECCP3DEL_PDC4                 1378
#define P3DC4                         1379
#define ECCP3DEL_PDC5                 1380
#define P3DC5                         1381
#define ECCP3DEL_PDC6                 1382
#define P3DC6                         1383
#define P3RSEN                        1384
#define ECCP3DEL_PRSEN                1385
#define ECCP3AS                       1386
#define ECCP3AS_PSSBD0                1387
#define PSS3BD0                       1388
#define ECCP3AS_PSSBD                 1389
#define ECCP3AS_PSSBD1                1390
#define PSS3BD1                       1391
#define ECCP3AS_PSSAC0                1392
#define PSS3AC0                       1393
#define ECCP3AS_PSSAC                 1394
#define ECCP3AS_PSSAC1                1395
#define PSS3AC1                       1396
#define ECCP3AS_ECCPAS0               1397
#define ECCP3AS_ECCPAS                1398
#define ECCP3AS0                      1399
#define ECCP3AS_ECCPAS1               1400
#define ECCP3AS1                      1401
#define ECCP3AS_ECCPAS2               1402
#define ECCP3AS2                      1403
#define ECCP3AS_ECCPASE               1404
#define ECCP3ASE                      1405
#define ECCP2CON                      1406
#define CCP2M                         1407
#define CCP2M0                        1408
#define CCP2M1                        1409
#define CCP2M2                        1410
#define CCP2M3                        1411
#define DC2B                          1412
#define DC2B0                         1413
#define CCP2Y                         1414
#define DC2B1                         1415
#define CCP2X                         1416
#define P2M                           1417
#define P2M0                          1418
#define P2M1                          1419
#define ECCP2DEL                      1420
#define P2DC0                         1421
#define ECCP2DEL_PDC0                 1422
#define ECCP2DEL_PDC                  1423
#define P2DC1                         1424
#define ECCP2DEL_PDC1                 1425
#define P2DC2                         1426
#define ECCP2DEL_PDC2                 1427
#define P2DC3                         1428
#define ECCP2DEL_PDC3                 1429
#define P2DC4                         1430
#define ECCP2DEL_PDC4                 1431
#define P2DC5                         1432
#define ECCP2DEL_PDC5                 1433
#define P2DC6                         1434
#define ECCP2DEL_PDC6                 1435
#define ECCP2DEL_PRSEN                1436
#define P2RSEN                        1437
#define ECCP2AS                       1438
#define ECCP2AS_PSSBD                 1439
#define ECCP2AS_PSSBD0                1440
#define PSS2BD0                       1441
#define ECCP2AS_PSSBD1                1442
#define PSS2BD1                       1443
#define PSS2AC0                       1444
#define ECCP2AS_PSSAC0                1445
#define ECCP2AS_PSSAC                 1446
#define ECCP2AS_PSSAC1                1447
#define PSS2AC1                       1448
#define ECCP2AS_ECCPAS                1449
#define ECCP2AS0                      1450
#define ECCP2AS_ECCPAS0               1451
#define ECCP2AS1                      1452
#define ECCP2AS_ECCPAS1               1453
#define ECCP2AS2                      1454
#define ECCP2AS_ECCPAS2               1455
#define ECCP2AS_ECCPASE               1456
#define ECCP2ASE                      1457
#define ECCP1CON                      1458
#define CCP1M0                        1459
#define CCP1M                         1460
#define CCP1M1                        1461
#define CCP1M2                        1462
#define CCP1M3                        1463
#define CCP1Y                         1464
#define DC1B                          1465
#define DC1B0                         1466
#define CCP1X                         1467
#define DC1B1                         1468
#define P1M                           1469
#define P1M0                          1470
#define P1M1                          1471
#define ECCP1DEL                      1472
#define P1DC0                         1473
#define ECCP1DEL_PDC0                 1474
#define ECCP1DEL_PDC                  1475
#define P1DC1                         1476
#define ECCP1DEL_PDC1                 1477
#define P1DC2                         1478
#define ECCP1DEL_PDC2                 1479
#define P1DC3                         1480
#define ECCP1DEL_PDC3                 1481
#define P1DC4                         1482
#define ECCP1DEL_PDC4                 1483
#define P1DC5                         1484
#define ECCP1DEL_PDC5                 1485
#define P1DC6                         1486
#define ECCP1DEL_PDC6                 1487
#define P1RSEN                        1488
#define ECCP1DEL_PRSEN                1489
#define ECCP1AS                       1490
#define ECCP1AS_PSSBD                 1491
#define ECCP1AS_PSSBD0                1492
#define PSS1BD0                       1493
#define ECCP1AS_PSSBD1                1494
#define PSS1BD1                       1495
#define ECCP1AS_PSSAC0                1496
#define PSS1AC0                       1497
#define ECCP1AS_PSSAC                 1498
#define ECCP1AS_PSSAC1                1499
#define PSS1AC1                       1500
#define ECCP1AS_ECCPAS0               1501
#define ECCP1AS_ECCPAS                1502
#define ECCP1AS0                      1503
#define ECCP1AS_ECCPAS1               1504
#define ECCP1AS1                      1505
#define ECCP1AS_ECCPAS2               1506
#define ECCP1AS2                      1507
#define ECCP1ASE                      1508
#define ECCP1AS_ECCPASE               1509
#define WDTCON                        1510
#define SWDTEN                        1511
#define SWDTE                         1512
#define ADSHR                         1513
#define DEVCFG                        1514
#define LVDSTAT                       1515
#define REGSLP                        1516
#define ANCON0                        1517
#define PCFGL                         1518
#define PCFG0                         1519
#define PCFG1                         1520
#define PCFG2                         1521
#define PCFG3                         1522
#define PCFG4                         1523
#define PCFG5                         1524
#define PCFG6                         1525
#define PCFG7                         1526
#define ADCON1                        1527
#define ADCS0                         1528
#define ADCS                          1529
#define ADCS1                         1530
#define ADCS2                         1531
#define ACQT0                         1532
#define ACQT                          1533
#define CHSN3                         1534
#define ACQT1                         1535
#define VCFG01                        1536
#define ACQT2                         1537
#define VCFG11                        1538
#define ADCON1_ADCAL                  1539
#define ADFM                          1540
#define ANCON1                        1541
#define PCFGH                         1542
#define PCFG8                         1543
#define PCFG9                         1544
#define PCFG10                        1545
#define PCFG11                        1546
#define PCFG12                        1547
#define PCFG13                        1548
#define PCFG14                        1549
#define PCFG15                        1550
#define ADCON0                        1551
#define ADON                          1552
#define GO_nDONE                      1553
#define NOT_DONE                      1554
#define GODONE                        1555
#define GO_DONE                       1556
#define DONE                          1557
#define GO                            1558
#define GO_NOT_DONE                   1559
#define CHS                           1560
#define CHS0                          1561
#define CHS1                          1562
#define CHS2                          1563
#define CHS3                          1564
#define VCFG                          1565
#define VCFG0                         1566
#define VCFG1                         1567
#define ADCON0_ADCAL                  1568
#define SSP1CON2                      1569
#define SEN1                          1570
#define SSP1CON2_SEN                  1571
#define ADMSK11                       1572
#define SSP1CON2_RSEN                 1573
#define RSEN1                         1574
#define SSP1CON2_ADMSK1               1575
#define SSP1CON2_PEN                  1576
#define ADMSK21                       1577
#define PEN1                          1578
#define SSP1CON2_ADMSK2               1579
#define ADMSK31                       1580
#define RCEN1                         1581
#define SSP1CON2_RCEN                 1582
#define SSP1CON2_ADMSK3               1583
#define SSP1CON2_ACKEN                1584
#define ACKEN1                        1585
#define ADMSK41                       1586
#define SSP1CON2_ADMSK4               1587
#define ACKDT1                        1588
#define ADMSK51                       1589
#define SSP1CON2_ACKDT                1590
#define SSP1CON2_ADMSK5               1591
#define SSP1CON2_ACKSTAT              1592
#define ACKSTAT1                      1593
#define GCEN1                         1594
#define SSP1CON2_GCEN                 1595
#define SSP1CON1                      1596
#define SSP1CON1_SSPM0                1597
#define SSPM01                        1598
#define SSP1CON1_SSPM                 1599
#define SSP1CON1_SSPM1                1600
#define SSPM11                        1601
#define SSP1CON1_SSPM2                1602
#define SSPM21                        1603
#define SSPM31                        1604
#define SSP1CON1_SSPM3                1605
#define SSP1CON1_CKP                  1606
#define CKP1                          1607
#define SSPEN1                        1608
#define SSP1CON1_SSPEN                1609
#define SSPOV1                        1610
#define SSP1CON1_SSPOV                1611
#define WCOL1                         1612
#define SSP1CON1_WCOL                 1613
#define SSP1STAT                      1614
#define BF1                           1615
#define SSP1STAT_BF                   1616
#define UA1                           1617
#define SSP1STAT_UA                   1618
#define SSP1STAT_R_NOT_W              1619
#define RW1                           1620
#define NOT_W                         1621
#define SSP1STAT_R                    1622
#define SSP1STAT_nW                   1623
#define RW                            1624
#define SSP1STAT_READ_WRITE           1625
#define SSP1STAT_nWRITE               1626
#define SSP1STAT_I2C_READ             1627
#define SSP1STAT_R_W                  1628
#define SSP1STAT_NOT_WRITE            1629
#define SSP1STAT_R_nW                 1630
#define SSP1STAT_S                    1631
#define START                         1632
#define START1                        1633
#define SSP1STAT_I2C_START            1634
#define STOP                          1635
#define SSP1STAT_P                    1636
#define STOP1                         1637
#define SSP1STAT_I2C_STOP             1638
#define SSP1STAT_D                    1639
#define SSP1STAT_D_NOT_A              1640
#define NOT_A                         1641
#define SSP1STAT_D_A                  1642
#define SSP1STAT_D_nA                 1643
#define SSP1STAT_NOT_ADDRESS          1644
#define SSP1STAT_nA                   1645
#define DA1                           1646
#define DA                            1647
#define SSP1STAT_nADDRESS             1648
