tiborsimon/embedded-tdd-headers/pic/pic18/pic18f86j55_tdd.h
#define SSP1STAT_I2C_DAT              1649
#define SSP1STAT_DATA_ADDRESS         1650
#define SSP1STAT_CKE                  1651
#define CKE1                          1652
#define SSP1STAT_SMP                  1653
#define SMP1                          1654
#define SSP1ADD                       1655
#define SSP1ADD_MSK0                  1656
#define MSK01                         1657
#define SSP1ADD_MSK1                  1658
#define MSK11                         1659
#define SSP1ADD_MSK2                  1660
#define MSK21                         1661
#define MSK31                         1662
#define SSP1ADD_MSK3                  1663
#define SSP1ADD_MSK4                  1664
#define MSK41                         1665
#define MSK51                         1666
#define SSP1ADD_MSK5                  1667
#define SSP1ADD_MSK6                  1668
#define MSK61                         1669
#define SSP1ADD_MSK7                  1670
#define MSK71                         1671
#define SSP1MSK                       1672
#define SSP1MSK_MSK0                  1673
#define SSP1MSK_MSK1                  1674
#define SSP1MSK_MSK2                  1675
#define SSP1MSK_MSK3                  1676
#define SSP1MSK_MSK4                  1677
#define SSP1MSK_MSK5                  1678
#define SSP1MSK_MSK6                  1679
#define SSP1MSK_MSK7                  1680
#define T2CON                         1681
#define T2CKPS0                       1682
#define T2CKPS                        1683
#define T2CKPS1                       1684
#define TMR2ON                        1685
#define T2OUTPS0                      1686
#define TOUTPS                        1687
#define T2OUTPS1                      1688
#define T2OUTPS2                      1689
#define T2OUTPS3                      1690
#define MEMCON                        1691
#define WM                            1692
#define WM0                           1693
#define WM1                           1694
#define WAIT0                         1695
#define WAIT                          1696
#define WAIT1                         1697
#define EBDIS                         1698
#define EDBIS                         1699
#define PADCFG1                       1700
#define PMPTL                         1701
#define PMPTTL                        1702
#define ODCON3                        1703
#define SPI1OD                        1704
#define SPI2OD                        1705
#define T1CON                         1706
#define TMR1ON                        1707
#define TMR1CS                        1708
#define NOT_T1SYNC                    1709
#define T1SYNC                        1710
#define nT1SYNC                       1711
#define T1INSYNC                      1712
#define T1OSCEN                       1713
#define SOSCEN                        1714
#define T1CKPS0                       1715
#define T1CKPS                        1716
#define T1CKPS1                       1717
#define T1RUN                         1718
#define T1RD16                        1719
#define T1CON_RD16                    1720
#define ODCON2                        1721
#define USART1OD                      1722
#define U1OD                          1723
#define U2OD                          1724
#define USART2OD                      1725
#define ODCON1                        1726
#define ECCP1OD                       1727
#define ECCP2OD                       1728
#define ECCP3OD                       1729
#define CCP4OD                        1730
#define CCP5OD                        1731
#define RCON                          1732
#define BOR                           1733
#define NOT_BOR                       1734
#define nBOR                          1735
#define POR                           1736
#define nPOR                          1737
#define NOT_POR                       1738
#define PD                            1739
#define nPD                           1740
#define NOT_PD                        1741
#define nTO                           1742
#define TO                            1743
#define NOT_TO                        1744
#define nRI                           1745
#define NOT_RI                        1746
#define RI                            1747
#define NOT_CM                        1748
#define CM                            1749
#define nCM                           1750
#define IPEN                          1751
#define CM2CON1                       1752
#define CM2CON1_C1CH0                 1753
#define CM2CON1_CCH                   1754
#define CM2CON1_CCH0                  1755
#define CCH02                         1756
#define C1CH02                        1757
#define CM2CON1_C1CH1                 1758
#define CCH12                         1759
#define C1CH12                        1760
#define CM2CON1_CCH1                  1761
#define CM2CON1_CREF                  1762
#define CREF2                         1763
#define EVPOL02                       1764
#define CM2CON1_EVPOL0                1765
#define CM2CON1_EVPOL                 1766
#define CM2CON1_EVPOL1                1767
#define EVPOL12                       1768
#define CM2CON1_CPOL                  1769
#define CPOL2                         1770
#define COE2                          1771
#define CM2CON1_COE                   1772
#define CM2CON1_CON                   1773
#define CON2                          1774
#define CM1CON1                       1775
#define CM1CON1_CCH0                  1776
#define CM1CON1_CCH                   1777
#define CCH01                         1778
#define CM1CON1_C1CH0                 1779
#define CM1CON1_CCH1                  1780
#define CCH11                         1781
#define CM1CON1_C1CH1                 1782
#define CM1CON1_CREF                  1783
#define CREF1                         1784
#define CM1CON1_EVPOL0                1785
#define EVPOL01                       1786
#define CM1CON1_EVPOL                 1787
#define CM1CON1_EVPOL1                1788
#define EVPOL11                       1789
#define CM1CON1_CPOL                  1790
#define CPOL1                         1791
#define COE1                          1792
#define CM1CON1_COE                   1793
#define CM1CON1_CON                   1794
#define CON1                          1795
#define REFOCON                       1796
#define RODIV0                        1797
#define RODIV                         1798
#define RODIV1                        1799
#define RODIV2                        1800
#define RODIV3                        1801
#define ROSEL                         1802
#define ROSSLP                        1803
#define ROON                          1804
#define OSCCON                        1805
#define SCS0                          1806
#define SCS                           1807
#define SCS1                          1808
#define OSTS                          1809
#define IRCF                          1810
#define IRCF0                         1811
#define IRCF1                         1812
#define IRCF2                         1813
#define IDLEN                         1814
#define T0CON                         1815
#define T0PS                          1816
#define T0PS0                         1817
#define T0PS1                         1818
#define T0PS2                         1819
#define PSA                           1820
#define T0PS3                         1821
#define T0SE                          1822
#define T0CS                          1823
#define T08BIT                        1824
#define TMR0ON                        1825
#define STATUS                        1826
#define C                             1827
#define CARRY                         1828
#define DC                            1829
#define ZERO                          1830
#define Z                             1831
#define OV                            1832
#define OVERFLOW                      1833
#define N                             1834
#define NEGATIVE                      1835
#define INTCON3                       1836
#define INT1IF                        1837
#define INT1F                         1838
#define INT2IF                        1839
#define INT2F                         1840
#define INT3F                         1841
#define INT3IF                        1842
#define INT1E                         1843
#define INT1IE                        1844
#define INT2IE                        1845
#define INT2E                         1846
#define INT3E                         1847
#define INT3IE                        1848
#define INT1P                         1849
#define INT1IP                        1850
#define INT2IP                        1851
#define INT2P                         1852
#define INTCON2                       1853
#define RBIP                          1854
#define INT3IP                        1855
#define INT3P                         1856
#define TMR0IP                        1857
#define T0IP                          1858
#define INTEDG3                       1859
#define INTEDG2                       1860
#define INTEDG1                       1861
#define INTEDG0                       1862
#define RBPU                          1863
#define NOT_RBPU                      1864
#define nRBPU                         1865
#define INTCON                        1866
#define RBIF                          1867
#define INT0F                         1868
#define INT0IF                        1869
#define T0IF                          1870
#define TMR0IF                        1871
#define RBIE                          1872
#define INT0E                         1873
#define INT0IE                        1874
#define T0IE                          1875
#define TMR0IE                        1876
#define PEIE                          1877
#define PEIE_GIEL                     1878
#define GIEL                          1879
#define GIE_GIEH                      1880
#define GIE                           1881
#define GIEH                          1882
#define STKPTR0                       1883
#define STKPTR                        1884
#define SP0                           1885
#define STKPTR1                       1886
#define SP1                           1887
#define STKPTR2                       1888
#define SP2                           1889
#define SP3                           1890
#define STKPTR3                       1891
#define STKPTR4                       1892
#define SP4                           1893
#define STKUNF                        1894
#define STKOVF                        1895
#define STKFUL                        1896

#endif // _PIC18F86J55_H_
